<a href="https://colab.research.google.com/github/JP109/ML-Basics/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

# **1. Series**

### **1. Create Series:**

In [2]:
# Using a list
list_1=['a','b','c','d']
labels_1=[1,2,3,4]

series_1 = pd.Series(data=list_1, index=labels_1)
series_1

1    a
2    b
3    c
4    d
dtype: object

In [3]:
# Using a numpy array
arr_1 = np.array([1,2,3,4])

series_2 = pd.Series(arr_1)
series_2

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
# Using a dictionary
dict_1={'name':'Jai', 'surname':'Pawar', 'age':20}

series_3 = pd.Series(dict_1)
series_3

name         Jai
surname    Pawar
age           20
dtype: object

### **2. Access data in series**

In [5]:
series_3['name']

'Jai'

In [6]:
# Get data type
series_2.dtype

dtype('int64')

### **3. Math operations**

In [7]:
series_2 + series_2

0    2
1    4
2    6
3    8
dtype: int64

In [8]:
series_2 / series_2

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float64

In [9]:
# Pass them into numpy functions
np.exp(series_2)

0     2.718282
1     7.389056
2    20.085537
3    54.598150
dtype: float64

Main difference between Series and numpy arrays is that operations align by labels in Series:

In [10]:
series_4=pd.Series({4:5,5:6,6:7,7:8})
series_2 + series_4

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
dtype: float64

This happened because both the series did not line up according to their labels

In [11]:
# Assign names to series
series_5 = pd.Series({1:2, 3:4}, name='yeehaw')
series_5.name

'yeehaw'

# **2. Dataframe**

### **1. Creating dataframes**

In [12]:
# Using numpy array
arr_2 =np.random.randint(10,50,size=(2,3))
df_1 = pd.DataFrame(arr_2,['A','B'],['C','D','E'])
df_1

    C   D   E
A  44  35  24
B  13  38  24

In [13]:
# Using multiple Series
dict_3 = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 'two': pd.Series([4, 5, 6, 7], index=['a', 'b', 'c', 'd'])}
df_2 = pd.DataFrame(dict_3)
df_2

   one  two
a  1.0    4
b  2.0    5
c  3.0    6
d  NaN    7

In [14]:
# Using a dictionary 
#from_dict() has 3 params= data:Supplied below, orient:default is 'column' as below, can be reversed ny supplying 'index,
#columns:list of values to be used as labels when orientation is 'index'
df_3 = pd.DataFrame.from_dict(dict([('A',[1,2,3]),('B',[4,5,6])]))
df_3

   A  B
0  1  4
1  2  5
2  3  6

In [15]:
# Shape of df
df_1.shape

(2, 3)

### **2. Accessing/Editing data**

In [16]:
# Accessing a column using a label
df_1['C']

A    44
B    13
Name: C, dtype: int64

In [17]:
df_1[['C','D']]

    C   D
A  44  35
B  13  38

In [18]:
# Accessing a row as a series
df_1.loc['A']

C    44
D    35
E    24
Name: A, dtype: int64

In [19]:
df_1.iloc[1]

C    13
D    38
E    24
Name: B, dtype: int64

In [20]:
# Accessing rows and columns
df_1.loc[['A','B'], ['D','E']]

    D   E
A  35  24
B  38  24

In [21]:
# Create a new column
df_1['Total']=df_1['C']+df_1['D']+df_1['E']
df_1

    C   D   E  Total
A  44  35  24    103
B  13  38  24     75

In [22]:
# Create a new row
dict_2 = {'C':44, 'D':45, 'E': 46}
new_row = pd.Series(dict_2, name='F')
df_1 = df_1.append(new_row)
df_1

      C     D     E  Total
A  44.0  35.0  24.0  103.0
B  13.0  38.0  24.0   75.0
F  44.0  45.0  46.0    NaN

In [23]:
# Delete columns
df_1.drop('Total', axis=1, inplace=True)
df_1

      C     D     E
A  44.0  35.0  24.0
B  13.0  38.0  24.0
F  44.0  45.0  46.0

In [24]:
# Delete rows
df_1.drop('B', axis=0, inplace=True)
df_1

      C     D     E
A  44.0  35.0  24.0
F  44.0  45.0  46.0

In [25]:
# Set a column as index
df_1['Sex'] = ['Men', 'Women']
df_1.set_index('Sex', inplace=True)
df_1

          C     D     E
Sex
Men    44.0  35.0  24.0
Women  44.0  45.0  46.0

In [26]:
# Replace index with numbers
df_1.reset_index(inplace=True)
df_1

     Sex     C     D     E
0    Men  44.0  35.0  24.0
1  Women  44.0  45.0  46.0

In [27]:
# Adding a column using .assign()
# This allows columns to be added in any position, unlike only at the end with the list method
# It returns a copy of the original df with the new column(or any other change), without touching original df

df_4= df_1.assign(J=df_1['C']*df_1['D'])
print(df_4)
print(df_1)

     Sex     C     D     E       J
0    Men  44.0  35.0  24.0  1540.0
1  Women  44.0  45.0  46.0  1980.0
     Sex     C     D     E
0    Men  44.0  35.0  24.0
1  Women  44.0  45.0  46.0

In [28]:
# Chained indexing
# Setting values by using chained indexing can have unexpected results(check out link below)
df_4['D'][0]=float('nan')
df_4

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

     Sex     C     D     E       J
0    Men  44.0   NaN  24.0  1540.0
1  Women  44.0  45.0  46.0  1980.0

In [29]:
# Hence, loc should be used instead of chained indexing
df_4.loc[1,'D']=float('nan')
df_4

     Sex     C   D     E       J
0    Men  44.0 NaN  24.0  1540.0
1  Women  44.0 NaN  46.0  1980.0

In [30]:
# Combine dataframes, combine_first() replaces NaN elements of 1st array with corresponding elements of 2nd array
df_4.combine_first(df_1)

      C     D     E       J    Sex
0  44.0  35.0  24.0  1540.0    Men
1  44.0  45.0  46.0  1980.0  Women

In [31]:
# Conditional indexing
# All conditional operators return boolean
# gt, lt, ge, le, eq & ne are comparison operators, apart from the normal python ones(>,<,>=,<=,==,!=)
print(df_2)

print(df_2>2)
df_2.gt(2)

   one  two
a  1.0    4
b  2.0    5
c  3.0    6
d  NaN    7
     one   two
a  False  True
b  False  True
c   True  True
d  False  True

     one   two
a  False  True
b  False  True
c   True  True
d  False  True

In [32]:
# Storing the condition result in a variable
bool_1 = df_2>5
df_2[bool_1]

   one  two
a  NaN  NaN
b  NaN  NaN
c  NaN  6.0
d  NaN  7.0

In [33]:
# Conditions for a single column
df_2['two']>5

a    False
b    False
c     True
d     True
Name: two, dtype: bool

In [34]:
# Return row only if cell value in column matches a condition
df_2[df_2['two']>5]

   one  two
c  3.0    6
d  NaN    7

In [35]:
# Selections can be stacked
df_2[df_2['two']>5]['one']

c    3.0
d    NaN
Name: one, dtype: float64

In [36]:
# Multiple conditions
df_2[(df_2['two']>5) & (df_2['two']<7)]

   one  two
c  3.0    6

### **3. Importing data**
Pandas can work with CSV, txt files, JSON, XML, PDF, SQL, HTML, XLSX, DOCX, ZIP, Images, Hierachial data format, MP3, MP4 and more

In [37]:
# import pymysql

# # Read a CSV file
# # Type pd.read_ [TAB] to see the file types you can read
# cs_df = pd.read_csv('ComputerSales.csv')

# # Save a CSV file, but don't save the index as a column
# cs_df.to_csv('ComputerSalesBU.csv', index=False)

# # You can read data from Excel, but not formulas and macros
# pd.read_excel('Financial Sample.xlsx',0)

# # Write to Excel
# cs_df.to_excel('ComputerSales.xlsx')

# # Check if written
# pd.read_excel('ComputerSales.xlsx',0)

# # Read from MySQL Database
# try:
#     db_connection = pymysql.connect(db='students', user='studentadmin', passwd='TurtleDove', host='localhost', port=3306)

#     stud_df = pd.read_sql('SELECT * FROM students', con=db_connection)
#     # print(stud_df)
# except Exception as e:
#     print("Exception : {}".format(e))
# finally:
#     db_connection.close()
    

# # Write to table
# try:
#     db_connection = pymysql.connect(db='students', user='studentadmin', passwd='TurtleDove', host='localhost', port=3306)
#     # Used to issue queries
#     cursor = db_connection.cursor()
#     # Query to enter new student
#     insert_stmt = "INSERT INTO students VALUES(NULL, 'Frank', 'Silva', 'fsilva@aol.com', '666 Hell St', 'Yakima', 'WA', 98901, '792-223-8966', '1959-2-22', 'M', NOW(), 3.50)"
#     # Execute query
#     cursor.execute(insert_stmt)
#     # Commit changes to DB
#     db_connection.commit()
#     stud_df = pd.read_sql('SELECT * FROM students', con=db_connection)
#     print(stud_df)
# except Exception as e:
#     print("Exception : {}".format(e))
# finally:
#     db_connection.close()

# # Just get 1 column of data 
# cs_df_st = pd.read_csv('ComputerSales.csv', usecols=["State"], squeeze=True)
# cs_df_st

### **4. Mathematical operations and functions**

In [38]:
# Get first 5 rows, stepped through 2 at a time
df_2[:5:2]

   one  two
a  1.0    4
c  3.0    6

In [39]:
# Get all indexes
df_2.index.array

<PandasArray>
['a', 'b', 'c', 'd']
Length: 4, dtype: object

In [40]:
# Convert array to numpy array
df_2.to_numpy()
df_2

   one  two
a  1.0    4
b  2.0    5
c  3.0    6
d  NaN    7

In [41]:
# Add a new row to a df (i.e. adding the row to every row of the df)
df_2.add(df_2.iloc[1],axis='columns')

   one   two
a  3.0   9.0
b  4.0  10.0
c  5.0  11.0
d  NaN  12.0

In [42]:
# Subtract a column from a df
df_2.sub(df_2['one'], axis=0)

   one  two
a  0.0  3.0
b  0.0  3.0
c  0.0  3.0
d  NaN  NaN

In [43]:
# Check if df is empty
df_2.empty

False

In [44]:
# Execute a function on a df
# transfrom() applies the function on every element of df
df_2.transform(lambda x:x+10)

    one  two
a  11.0   14
b  12.0   15
c  13.0   16
d   NaN   17

In [45]:
# Execute multiple functions
df_2.transform([lambda x: x**2, lambda x: x**3])

       one               two
  <lambda> <lambda> <lambda> <lambda>
a      1.0      1.0       16       64
b      4.0      8.0       25      125
c      9.0     27.0       36      216
d      NaN      NaN       49      343

In [46]:
# Execute different functions on different columns
print(df_2)
df_2.transform({'one':lambda x:x*20, 'two':lambda x:x/20})

   one  two
a  1.0    4
b  2.0    5
c  3.0    6
d  NaN    7

    one   two
a  20.0  0.20
b  40.0  0.25
c  60.0  0.30
d   NaN  0.35

In [47]:
# Perform a function on a single column:
df_2['one'].map(lambda x:x*20)

a    20.0
b    40.0
c    60.0
d     NaN
Name: one, dtype: float64

In [48]:
# Perform a function on entire df
df_2.applymap(lambda x:x*20)

    one  two
a  20.0   80
b  40.0  100
c  60.0  120
d   NaN  140

In [49]:
# Get all unique values of a column
df_2['one'].unique()

array([ 1.,  2.,  3., nan])

In [51]:
# Get total no. of unique values in a column
df_2['one'].nunique()

3

In [52]:
# No. of times a value is repeated in a column
df_2['two'].value_counts()

7    1
6    1
5    1
4    1
Name: two, dtype: int64

In [53]:
# Column names of a df:
df_2.columns

Index(['one', 'two'], dtype='object')

In [54]:
# Index names of a df:
df_2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

### **5. Grouping**

In [55]:
dict_4 = {'store': [1,2,1,2], 'Flavor':['Vanilla', 'Choco', 'Straw', 'Vanilla'], 'Sales':[26,12,18,22]}
df_11 = pd.DataFrame(dict_4)
df_11

   store   Flavor  Sales
0      1  Vanilla     26
1      2    Choco     12
2      1    Straw     18
3      2  Vanilla     22

In [59]:
# Group rows based on columns
by_store = df_11.groupby('store')
by_store.mean()

       Sales
store
1         22
2         17

In [69]:
# Get total for just one row
by_store = df_11.groupby('store')
by_store.sum().loc[1]

Sales    44
Name: 1, dtype: int64

### **6. Concat, Merge and Join**

In [87]:
df_12 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'key':[1,2,3]}, index=[1,2,3])
df_13 = pd.DataFrame({'A':[7,8,9], 'B':[10,11,12], 'key':[1,2,3]}, index=[4,5,6])
print(df_12)
print(df_13)

   A  B  key
1  1  4    1
2  2  5    2
3  3  6    3
   A   B  key
4  7  10    1
5  8  11    2
6  9  12    3

In [88]:
# Concatenate dfs
pd.concat([df_12,df_13])

   A   B  key
1  1   4    1
2  2   5    2
3  3   6    3
4  7  10    1
5  8  11    2
6  9  12    3

In [89]:
# Merge dfs using common keys
# Merges can be of type inner,outer,left or right

pd.merge(df_12, df_13, how='inner', on='key')

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [96]:
# Join dfs having different indices
df_14 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]}, index=[1,2,3])
df_15 = pd.DataFrame({'C':[7,8,9], 'D':[10,11,12]}, index=[1,5,6])

df_14.join(df_15, how='outer')

     A    B    C     D
1  1.0  4.0  7.0  10.0
2  2.0  5.0  NaN   NaN
3  3.0  6.0  NaN   NaN
5  NaN  NaN  8.0  11.0
6  NaN  NaN  9.0  12.0